<a href="https://colab.research.google.com/github/T0nT0n/PrIS_1/blob/main/Laba2.2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [15]:
import pandas as pd
import numpy as np
from IPython.display import display

In [8]:
data = pd.read_csv("https://archive.ics.uci.edu/ml/machine-learning-databases/glass/glass.data", header=None)
data.head(3)

   0        1      2     3     4      5     6     7    8    9   10
0   1  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0   1
1   2  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0   1
2   3  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0   1

In [9]:
names = ["Id", "RI", "Na", "Mg", "Al", "Si", "K", "Ca", "Ba", "Fe", "Class"]
data.columns = names
data = data.drop(columns=['Id'])
data.head(3)

        RI     Na    Mg    Al     Si     K    Ca   Ba   Fe  Class
0  1.52101  13.64  4.49  1.10  71.78  0.06  8.75  0.0  0.0      1
1  1.51761  13.89  3.60  1.36  72.73  0.48  7.83  0.0  0.0      1
2  1.51618  13.53  3.55  1.54  72.99  0.39  7.78  0.0  0.0      1

In [11]:
data['Class'].replace({1: "building_windows_float_processed",
                       2: "building_windows_non_float_processed",
                       3: "vehicle_windows_float_processed",
                       4: "vehicle_windows_non_float_processed",
                       5: "containers",
                       6: "tableware",
                       7: "headlamps"}, inplace = True)
data['Class'].value_counts()

building_windows_non_float_processed    76
building_windows_float_processed        70
headlamps                               29
vehicle_windows_float_processed         17
containers                              13
tableware                                9
Name: Class, dtype: int64

In [13]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      214 non-null    float64
 1   Na      214 non-null    float64
 2   Mg      214 non-null    float64
 3   Al      214 non-null    float64
 4   Si      214 non-null    float64
 5   K       214 non-null    float64
 6   Ca      214 non-null    float64
 7   Ba      214 non-null    float64
 8   Fe      214 non-null    float64
 9   Class   214 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

Добавим случайные пропуски

In [16]:
for col in data.columns:
  fr = np.random.randint(5,10)/100
  data.loc[data.sample(frac = fr).index, col] = np.nan
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      195 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      197 non-null    float64
 3   Al      199 non-null    float64
 4   Si      203 non-null    float64
 5   K       203 non-null    float64
 6   Ca      199 non-null    float64
 7   Ba      199 non-null    float64
 8   Fe      201 non-null    float64
 9   Class   203 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

# Data Vizualization

In [17]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 214 entries, 0 to 213
Data columns (total 10 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   RI      195 non-null    float64
 1   Na      199 non-null    float64
 2   Mg      197 non-null    float64
 3   Al      199 non-null    float64
 4   Si      203 non-null    float64
 5   K       203 non-null    float64
 6   Ca      199 non-null    float64
 7   Ba      199 non-null    float64
 8   Fe      201 non-null    float64
 9   Class   203 non-null    object
dtypes: float64(9), object(1)
memory usage: 16.8+ KB

In [18]:
data.describe()

               RI          Na          Mg  ...          Ca          Ba          Fe
count  195.000000  199.000000  197.000000  ...  199.000000  199.000000  201.000000
mean     1.518417   13.404523    2.674670  ...    8.948291    0.177588    0.056965
std      0.003143    0.807743    1.451842  ...    1.398125    0.503180    0.098804
min      1.511150   10.730000    0.000000  ...    5.430000    0.000000    0.000000
25%      1.516515   12.915000    1.880000  ...    8.255000    0.000000    0.000000
50%      1.517640   13.300000    3.480000  ...    8.600000    0.000000    0.000000
75%      1.519355   13.850000    3.600000  ...    9.145000    0.000000    0.100000
max      1.533930   17.380000    4.490000  ...   16.190000    3.150000    0.510000

[8 rows x 9 columns]

In [19]:
data['Class'].describe()

count                                      203
unique                                       6
top       building_windows_non_float_processed
freq                                        74
Name: Class, dtype: object

In [20]:
data['Class'].value_counts()

building_windows_non_float_processed    74
building_windows_float_processed        66
headlamps                               27
vehicle_windows_float_processed         16
containers                              12
tableware                                8
Name: Class, dtype: int64

In [22]:
display(data['Class'].describe())
display(print('============================='))
display(data['Class'].value_counts())

count                                      203
unique                                       6
top       building_windows_non_float_processed
freq                                        74
Name: Class, dtype: object

=============================

None

building_windows_non_float_processed    74
building_windows_float_processed        66
headlamps                               27
vehicle_windows_float_processed         16
containers                              12
tableware                                8
Name: Class, dtype: int64